Catalogs/пПартия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>пПартия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пSKU</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пУчастники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брак</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеБрака</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартияРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пПартия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пУчастники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПромышленностьВызовСервера/Ext/Module.bsl
Функция НашУчастник() Экспорт
	Возврат Константы.пНашУчастник.Получить();
КонецФункции

Функция ПостроитьДерево() Экспорт
	Результат = Новый ДеревоЗначений;
	Результат.Колонки.Добавить("Партия");
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пПартия.Ссылка
		|ИЗ
		|	Справочник.пПартия КАК пПартия
		|ГДЕ
		|	пПартия.ПартияРодитель = &Родитель
		|	И пПартия.Участник = &Участник";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.пПартия.ПустаяСсылка());
	Запрос.УстановитьПараметр("Участник", Константы.пНашУчастник.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Результат.Строки.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка = Результат.Строки.Добавить();
		Строка.Партия = ВыборкаДетальныеЗаписи.Ссылка;
		ЗаполнитьДочерниеУзлы(Строка, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьДочерниеУзлы(РодительСтроки, РодительСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пПартия.Ссылка
		|ИЗ
		|	Справочник.пПартия КАК пПартия
		|ГДЕ
		|	пПартия.ПартияРодитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", РодительСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка = РодительСтроки.Строки.Добавить();
		Строка.Партия = ВыборкаДетальныеЗаписи.Ссылка;
		ЗаполнитьДочерниеУзлы(Строка, ВыборкаДетальныеЗаписи.Ссылка)
	КонецЦикла;
КонецПроцедуры
